ALSwitch(config)#enable password cisco
ALSwitch(config)#enable password abc
ALSwitch(config)#enable secret class
ALSwitch(config)#interface VLAN 1
ALSwitch(config-if)#ip address 192.168.1.2 255.255.255.0
ALSwitch(config-if)#exit
ALSwitch(config)#ip default-gateway 192.168.1.1
ALSwitch(config)#exit
ALSwitch#
%SYS-5-CONFIG_I: Configured from console by console

ALSwitch#show interface VLAN 1
Vlan1 is administratively down, line protocol is down
  Hardware is CPU Interface, address is 0003.e4cc.091b (bia 0003.e4cc.091b)
  Internet address is 192.168.1.2/24
  MTU 1500 bytes, BW 100000 Kbit, DLY 1000000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 21:40:21, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     1682 packets input, 530955 bytes, 0 no buffer
     Received 0 broadcasts (0 IP multicast)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     563859 packets output, 0 bytes, 0 underruns
     0 output errors, 23 interface resets
     0 output buffer failures, 0 output buffers swapped out

ALSwitch#no shutdown
            ^
% Invalid input detected at '^' marker.
	
ALSwitch#no shutdown
            ^
% Invalid input detected at '^' marker.
	
ALSwitch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
ALSwitch(config)#no shutdown
                     ^
% Invalid input detected at '^' marker.
	
ALSwitch(config)#interface VLAN 1
ALSwitch(config-if)#no shutdown

ALSwitch(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
  
ALSwitch(config-if)#exit
ALSwitch(config)#exit
ALSwitch#
%SYS-5-CONFIG_I: Configured from console by console

ALSwitch#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
ALSwitch#show startup-config
Using 1253 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname ALSwitch
!
enable secret 5 $1$mERr$9cTjUIEqNGurQiFU.ZeCi1
enable password abc
!
!
!
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 ip address 192.168.1.2 255.255.255.0
!
ip default-gateway 192.168.1.1
!
!
!
!
line con 0
 password abc
 login
!
line vty 0 4
 login
line vty 5 9
 login
line vty 10 15
 password abc
 login
!
!
!
!
end


ALSwitch#exit









ALSwitch con0 is now available






Press RETURN to get started.













User Access Verification

Password: 

ALSwitch>
ALSwitch>